# 编写一个函数，输入是一个无符号整数，返回其二进制表达式中数字位数为 ‘1’ 的个数（也被称为汉明重量）。 
# 
#  
# 
#  示例 1： 
# 
#  输入：00000000000000000000000000001011
# 输出：3
# 解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。
#  
# 
#  示例 2： 
# 
#  输入：00000000000000000000000010000000
# 输出：1
# 解释：输入的二进制串 00000000000000000000000010000000 中，共有一位为 '1'。
#  
# 
#  示例 3： 
# 
#  输入：11111111111111111111111111111101
# 输出：31
# 解释：输入的二进制串 11111111111111111111111111111101 中，共有 31 位为 '1'。 
# 
#  
# 
#  提示： 
# 
#  
#  请注意，在某些语言（如 Java）中，没有无符号整数类型。在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，因为无论整数是有符号的
# 还是无符号的，其内部的二进制表示形式都是相同的。 
#  在 Java 中，编译器使用二进制补码记法来表示有符号整数。因此，在上面的 示例 3 中，输入表示有符号整数 -3。 
#  
# 
#  
# 
#  进阶: 
# 如果多次调用这个函数，你将如何优化你的算法？ 
#  Related Topics 位运算 
#  👍 213 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def hammingWeightBinCount(self, n: int) -> int:
        return bin(n).count('1')

    def hammingWeightBin(self, n: int) -> int:
        cnt = 0
        for num in bin(n):
            if num == '1':
                cnt += 1
        return cnt

    def hammingWeightMask(self, n: int) -> int:
        cnt = 0
        mask = 1
        for i in range(32):
            if n & mask != 0:
                cnt += 1
            mask <<= 1
        return cnt

    def hammingWeightMask1(self, n: int) -> int:
        """
        & 1 优雅
        """
        cnt = 0
        while n != 0:
            cnt += n & 1
            n >>= 1
        return cnt

    def hammingWeight(self, n: int) -> int:
        """
        n & (n - 1) 可以消去n的二进制表示中最后一个1
        若n是奇数: n最末位必为1，n-1最末位必为0，其他位相同，n & (n - 1) 最末位必为0
        若n是偶数: n最末位必为0，n-1必向最后一个1借位，n & (n - 1) 同样消去最后一个1
        """
        cnt = 0
        while n != 0:
            cnt += 1
            n &= n - 1
        return cnt
# leetcode submit region end(Prohibit modification and deletion)
