# 给定一个数组，它的第 i 个元素是一支给定的股票在第 i 天的价格。 
# 
#  设计一个算法来计算你所能获取的最大利润。你最多可以完成 k 笔交易。 
# 
#  注意: 你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。 
# 
#  示例 1: 
# 
#  输入: [2,4,1], k = 2
# 输出: 2
# 解释: 在第 1 天 (股票价格 = 2) 的时候买入，在第 2 天 (股票价格 = 4) 的时候卖出，这笔交易所能获得利润 = 4-2 = 2 。
#  
# 
#  示例 2: 
# 
#  输入: [3,2,6,5,0,3], k = 2
# 输出: 7
# 解释: 在第 2 天 (股票价格 = 2) 的时候买入，在第 3 天 (股票价格 = 6) 的时候卖出, 这笔交易所能获得利润 = 6-2 = 4 。
#      随后，在第 5 天 (股票价格 = 0) 的时候买入，在第 6 天 (股票价格 = 3) 的时候卖出, 这笔交易所能获得利润 = 3-0 = 3 
# 。
#  
#  Related Topics 动态规划 
#  👍 314 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def maxProfit(self, k: int, prices: List[int]) -> int:
        """
        三维DP
        dp[i][j][l]：第i天 已完成j次交易（卖出才算完成） l表示是否持有股票
        部分状态转移方程：
        dp[i][0][0] = 0
        dp[i][0][1] = max(dp[i - 1][0][1], dp[i - 1][0][0] - prices[i])
        dp[i][1][0] = max(dp[i - 1][1][0], dp[i - 1][0][1] + prices[i])
        dp[i][1][1] = max(dp[i - 1][1][1], dp[i - 1][1][0] - prices[i])
        dp[i][2][0] = max(dp[i - 1][2][0], dp[i - 1][1][1] + prices[i])
        …………
        dp[i][k][1] 不存在也用不到
        """
        if not prices:
            return 0

        n = len(prices)
        if k >= n >> 1:
            res = 0
            for i in range(1, len(prices)):
                res += max(0, prices[i] - prices[i - 1])
            return res

        dp = [[[0] * 2 for _ in range(k + 1)] for _ in range(n)]
        for j in range(k + 1):  # 初始化首日
            dp[0][j][1] = -prices[0]
        for i in range(1, n):
            for j in range(1, k + 1):  # 注意这里的技巧
                dp[i][j - 1][1] = max(dp[i - 1][j - 1][1], dp[i - 1][j - 1][0] - prices[i])
                dp[i][j][0] = max(dp[i - 1][j][0], dp[i - 1][j - 1][1] + prices[i])
        return dp[-1][-1][0]
# leetcode submit region end(Prohibit modification and deletion)
